# 課題: 級別為1 ，增加級別1 ，工資提升1000

employee = {
    "王力宏":{
        "部門":"科技部",
        "工資":3000,
        "級別":1
    },
    "周杰倫":{
        "部門":"市場部",
        "工資":5000,
        "級別":2
    },
    "林俊傑":{
        "部門":"市場部",
        "工資":7000,
        "級別":3
    },
    "張學友":{
        "部門":"科技部",
        "工資":4000,
        "級別":1
    },
    "劉德華":{
        "部門":"市場部",
        "工資":6000,
        "級別":2
    }
}

for level in employee:
    if(employee[level]["級別"]) == 1 :
        employee[level]["級別"]+=1
        employee[level]["工資"]+=1000
    
print(employee)    